Revit 2026 API
ExporterIFCUtils.SetGlobal3DOriginHandle Method
 Sets the handle representing the 3D origin.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static void SetGlobal3DOriginHandle(
	IFCAnyHandle origin
)
Public Shared Sub SetGlobal3DOriginHandle (
	origin As IFCAnyHandle
)
public:
static void SetGlobal3DOriginHandle(
	IFCAnyHandle^ origin
)
static member SetGlobal3DOriginHandle :
        origin : IFCAnyHandle -> unit
Parameters
origin IFCAnyHandle
 The origin handle.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace